balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC12LF1552.PIC
        <edc:SFRDef edc:access="-----rnn" edc:cname="AADSTAT" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0xx" edc:name="AADSTAT" edc:nzwidth="8" edc:por="-----0xx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADSTG" edc:desc="A/D Stage Status Bit" edc:mask="0x3" edc:name="ADSTG" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ADCONV" edc:desc="A/D Conversion Status Bit" edc:mask="0x1" edc:name="ADCONV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADSTG0" edc:desc="" edc:mask="0x1" edc:name="ADSTG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSTG1" edc:desc="" edc:mask="0x1" edc:name="ADSTG1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AADPRE" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AADPRE" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADPRE" edc:desc="A/D Precharge Time Select Bits" edc:mask="0x7f" edc:name="ADPRE" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPRE0" edc:desc="" edc:mask="0x1" edc:name="ADPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE1" edc:desc="" edc:mask="0x1" edc:name="ADPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE2" edc:desc="" edc:mask="0x1" edc:name="ADPRE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE3" edc:desc="" edc:mask="0x1" edc:name="ADPRE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE4" edc:desc="" edc:mask="0x1" edc:name="ADPRE4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE5" edc:desc="" edc:mask="0x1" edc:name="ADPRE5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPRE6" edc:desc="" edc:mask="0x1" edc:name="ADPRE6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="AADACQ" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="AADACQ" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADACQ" edc:desc="Acquisition/Charge Share Time Select Bits" edc:mask="0x7f" edc:name="ADACQ" edc:nzwidth="7"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACQ0" edc:desc="" edc:mask="0x1" edc:name="ADACQ0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ1" edc:desc="" edc:mask="0x1" edc:name="ADACQ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ2" edc:desc="" edc:mask="0x1" edc:name="ADACQ2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ3" edc:desc="" edc:mask="0x1" edc:name="ADACQ3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ4" edc:desc="" edc:mask="0x1" edc:name="ADACQ4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ5" edc:desc="" edc:mask="0x1" edc:name="ADACQ5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACQ6" edc:desc="" edc:mask="0x1" edc:name="ADACQ6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="AADGRD" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="AADGRD" edc:nzwidth="8" edc:por="000-----">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="GRDPOL" edc:desc="Guard Ring Polarity selection bit" edc:mask="0x1" edc:name="GRDPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDAOE" edc:desc="Guard Ring A Output Enable" edc:mask="0x1" edc:name="GRDAOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GRDBOE" edc:desc="Guard Ring B Output Enable" edc:mask="0x1" edc:name="GRDBOE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="AADCAP" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AADCAP" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADDCAP" edc:desc="ADC Additional Sample Capacitor Selection bits" edc:mask="0x7" edc:name="ADDCAP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDCAP0" edc:desc="" edc:mask="0x1" edc:name="ADDCAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP1" edc:desc="" edc:mask="0x1" edc:name="ADDCAP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDCAP2" edc:desc="" edc:mask="0x1" edc:name="ADDCAP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AADRES0" edc:desc="" edc:name="AADRES0" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AADRES0L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AADRES0L" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ADRES0L" edc:desc="" edc:mask="0xff" edc:name="ADRES0L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
